Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
Движения.Продажи.Записывать = Истина;

Для Каждого ТекСтрокаТовары Из Товары Цикл

    Движение = Движения.Продажи.Добавить();

    Движение.Период = Дата;
    Движение.Контрагент = Контрагент;
    Движение.Товар = ТекСтрокаТовары.Товары;
    Движение.Количество = ТекСтрокаТовары.Количество;
    Движение.Сумма = ТекСтрокаТовары.Сумма;

КонецЦикла;   

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

