Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    // Списание сырья
    Для каждого СтрокаСырья Из Сырье Цикл

        Движение = Движения.ОстаткиТоваров.Добавить();

        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Номенклатура = СтрокаСырья.Номенклатура;
        Движение.Количество = СтрокаСырья.Количество;

    КонецЦикла;

    // Поступление готовой продукции
    Для каждого СтрокаПродукции Из Продукция Цикл

        Движение = Движения.ОстаткиТоваров.Добавить();

        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Номенклатура = СтрокаПродукции.Номенклатура;
        Движение.Количество = СтрокаПродукции.Количество;

    КонецЦикла;

КонецПроцедуры